{
    "bhavuk1017@gmail.com": [
        {
            "task": "**Certification Task: Predicting Customer Churn for a Telecommunications Company**\n\n**Introduction:**\nAs a machine learning practitioner, you have been hired by a telecommunications company to develop a predictive model that can identify customers who are likely to churn. The company wants to use this model to proactively engage with high-risk customers and retain them.\n\n**Task Description:**\nYour task is to develop a machine learning model that can predict customer churn based on a dataset provided by the company. The dataset contains information about the customers, their usage patterns, and their demographic characteristics.\n\n**Dataset:**\n\nThe dataset consists of the following features:\n\n1. **Customer ID** (unique identifier for each customer)\n2. **Age** (customer's age)\n3. **Gender** (customer's gender)\n4. **Usage** (average monthly usage in minutes)\n5. **Bill Amount** (average monthly bill amount)\n6. **Contract Type** (type of contract: month-to-month, 1-year, 2-year)\n7. **Data Usage** (average monthly data usage in MB)\n8. **Customer Service Calls** (number of customer service calls made in the last 6 months)\n9. **Churn** (whether the customer has churned or not: 0 = no, 1 = yes)\n\nThe dataset contains 10,000 customer records, with 2,000 customers who have churned.\n\n**Task Requirements:**\n\n1. **Data Preprocessing:** Clean and preprocess the dataset by handling missing values, encoding categorical variables, and scaling/normalizing the data as necessary.\n2. **Feature Engineering:** Extract relevant features from the dataset that can help improve the performance of the model. This can include creating new features, transforming existing features, or selecting a subset of the most relevant features.\n3. **Model Selection:** Choose a suitable machine learning algorithm for this problem, such as logistic regression, decision trees, random forests, support vector machines, or neural networks.\n4. **Model Training:** Train the selected model on the preprocessed dataset and tune its hyperparameters to optimize its performance.\n5. **Model Evaluation:** Evaluate the performance of the trained model using metrics such as accuracy, precision, recall, F1-score, and area under the ROC curve (AUC-ROC).\n6. **Model Deployment:** Deploy the trained model in a suitable format (e.g., Python script, R script, or API) that can be used to make predictions on new, unseen data.\n\n**Deliverables:**\n\n1. A written report (max. 5 pages) that describes the approach taken, the preprocessing steps, feature engineering techniques, model selection, and evaluation metrics.\n2. A Python or R code snippet that implements the trained model, including data preprocessing, feature engineering, model training, and evaluation.\n3. A sample output of the model on a small test dataset (20-50 samples) that demonstrates its performance.\n\n**Evaluation Criteria:**\n\n1. **Model Performance:** The model's ability to predict customer churn accurately, as measured by the evaluation metrics (accuracy, precision, recall, F1-score, and AUC-ROC).\n2. **Code Quality:** The quality, readability, and maintainability of the provided code snippet.\n3. **Report Quality:** The clarity, coherence, and completeness of the written report.\n4. **Timeliness:** The ability to complete the task within the allocated timeframe (e.g., 2 weeks",
            "invigilator": "John Doe",
            "observation_sheet": "**Observation Sheet: Evaluating the Certification Task - Predicting Customer Churn for a Telecommunications Company**\n\n**Introduction:**\nThis observation sheet is designed to evaluate the candidate's ability to complete the certification task of predicting customer churn for a telecommunications company. The task requires the candidate to develop a machine learning model that can accurately predict customer churn based on a provided dataset.\n\n**Evaluation Criteria:**\n\n1. **Model Performance (30 points)**\n\t* Accuracy (5 points)\n\t* Precision (5 points)\n\t* Recall (5 points)\n\t* F1-score (5 points)\n\t* AUC-ROC (10 points)\n2. **Code Quality (20 points)**\n\t* Readability (5 points)\n\t* Maintainability (5 points)\n\t* Efficiency (5 points)\n\t* Adherence to best practices (5 points)\n3. **Report Quality (20 points)**\n\t* Clarity (5 points)\n\t* Coherence (5 points)\n\t* Completeness (5 points)\n\t* Organization (5 points)\n4. **Timeliness (10 points)**\n\t* Ability to complete the task within the allocated timeframe (10 points)\n5. **Additional Factors (20 points)**\n\t* Creativity and originality in approach (10 points)\n\t* Effective use of feature engineering and selection (5 points)\n\t* Model interpretability and explainability (5 points)\n\n**Evaluation Rubric:**\n\n1. **Model Performance:**\n\t* Excellent (24-30 points): The model demonstrates high accuracy, precision, recall, F1-score, and AUC-ROC.\n\t* Good (18-23 points): The model demonstrates good accuracy, precision, recall, F1-score, and AUC-ROC.\n\t* Fair (12-17 points): The model demonstrates fair accuracy, precision, recall, F1-score, and AUC-ROC.\n\t* Poor (0-11 points): The model demonstrates poor accuracy, precision, recall, F1-score, and AUC-ROC.\n2. **Code Quality:**\n\t* Excellent (18-20 points): The code is highly readable, maintainable, efficient, and adheres to best practices.\n\t* Good (14-17 points): The code is good in terms of readability, maintainability, efficiency, and adherence to best practices.\n\t* Fair (8-13 points): The code is fair in terms of readability, maintainability, efficiency, and adherence to best practices.\n\t* Poor (0-7 points): The code is poorly written and difficult to understand.\n3. **Report Quality:**\n\t* Excellent (18-20 points): The report is clear, coherent, complete, and well-organized.\n\t* Good (14-17 points): The report is good in terms of clarity, coherence, completeness, and organization.\n\t* Fair (8-13 points): The report is fair in terms of clarity, coherence, completeness, and organization.\n\t* Poor (0-7 points): The report is poorly written and lacking in detail.\n4. **Timeliness:**\n\t* Excellent (10 points): The task is completed within the allocated timeframe.\n\t* Good (5-9 points): The task is completed near the allocated timeframe.\n\t* Fair (1-4 points): The task is completed after the allocated timeframe.\n\t* Poor (0 points): The task is not completed.\n\n**Additional"
        },
        {
            "task": "**Certification Task: Predicting Customer Churn for a Telecommunications Company**\n\n**Background:**\n\nAs a Machine Learning engineer, you have been hired by a telecommunications company to develop a predictive model that can identify customers who are likely to churn (stop using the company's services) in the next 30 days. The company has provided you with a dataset containing customer information, usage patterns, and demographic data.\n\n**Task Objective:**\n\nYour objective is to develop a Machine Learning model that can predict customer churn with high accuracy, using the provided dataset. The model should be able to identify the most important factors that contribute to customer churn and provide insights that can be used by the company to develop targeted retention strategies.\n\n**Dataset:**\n\nThe dataset contains the following features:\n\n1. **Customer ID**: Unique identifier for each customer\n2. **Age**: Customer's age\n3. **Gender**: Customer's gender\n4. **Usage**: Average monthly usage of the company's services (e.g., minutes talked, data used)\n5. **Revenue**: Average monthly revenue generated by each customer\n6. **Tenure**: Length of time the customer has been with the company (in months)\n7. **Number of Complaints**: Number of complaints lodged by the customer in the past 6 months\n8. **Average Call Drop Rate**: Average call drop rate for each customer\n9. **Data Speed**: Average data speed experienced by each customer\n10. **Churn**: Binary label indicating whether the customer churned (1) or not (0)\n\nThe dataset consists of 10,000 customer records, with 2,000 customers who have churned and 8,000 customers who have not.\n\n**Task Requirements:**\n\n1. **Data Preprocessing**: Clean and preprocess the dataset to prepare it for modeling. This includes handling missing values, encoding categorical variables, and scaling/normalizing numerical features.\n2. **Feature Engineering**: Create new features that can help improve the model's performance. Some potential features to consider include:\n\t* **Average revenue per user (ARPU)**: Calculate the average revenue per user for each customer.\n\t* **Usage trend**: Calculate the trend of usage over time for each customer.\n\t* **Complaint rate**: Calculate the rate of complaints lodged by each customer.\n3. **Model Selection**: Choose a suitable Machine Learning algorithm for this problem. Some potential algorithms to consider include:\n\t* **Logistic Regression**: A linear model that can be used for binary classification problems.\n\t* **Decision Trees**: A tree-based model that can be used for classification and regression problems.\n\t* **Random Forest**: An ensemble model that can be used for classification and regression problems.\n\t* **Neural Networks**: A complex model that can be used for classification and regression problems.\n4. **Model Training**: Train the selected model using the preprocessed dataset. Tune hyperparameters to optimize the model's performance.\n5. **Model Evaluation**: Evaluate the model's performance using metrics such as accuracy, precision, recall, and F1-score. Compare the model's performance to a baseline model (e.g., a simple logistic regression model).\n6. **Feature Importance**: Calculate the importance of each feature in the dataset and provide insights on the most significant factors that contribute to customer churn.\n7. **Model Interpretation**: Provide interpretation of the model's results, including the predicted probabilities of churn for each customer and the factors that contribute to these predictions.\n\n",
            "invigilator": "John Doe",
            "observation_sheet": "**Certification Task: Predicting Customer Churn for a Telecommunications Company Observation Sheet**\n\n**Introduction:**\nThis observation sheet is designed to evaluate the performance of a Machine Learning model developed to predict customer churn for a telecommunications company. The model should be able to identify the most important factors that contribute to customer churn and provide insights that can be used by the company to develop targeted retention strategies.\n\n**Evaluation Criteria:**\n\n1. **Data Preprocessing (20 points)**\n\t* Were missing values handled correctly? (5 points)\n\t* Were categorical variables encoded correctly? (5 points)\n\t* Were numerical features scaled/normalized correctly? (5 points)\n\t* Were any other data preprocessing steps taken? (5 points)\n2. **Feature Engineering (20 points)**\n\t* Were relevant new features created to improve the model's performance? (10 points)\n\t* Were the created features correctly calculated and implemented? (5 points)\n\t* Were the created features relevant to the problem and useful for the model? (5 points)\n3. **Model Selection (15 points)**\n\t* Was a suitable Machine Learning algorithm selected for the problem? (10 points)\n\t* Was the selected algorithm justified and explained? (5 points)\n4. **Model Training (20 points)**\n\t* Was the model trained correctly using the preprocessed dataset? (10 points)\n\t* Were hyperparameters tuned to optimize the model's performance? (5 points)\n\t* Were any regularization techniques used to prevent overfitting? (5 points)\n5. **Model Evaluation (20 points)**\n\t* Were relevant metrics used to evaluate the model's performance (e.g., accuracy, precision, recall, F1-score)? (10 points)\n\t* Was the model's performance compared to a baseline model? (5 points)\n\t* Were the results interpreted and discussed? (5 points)\n6. **Feature Importance (10 points)**\n\t* Were the importance of each feature calculated and provided? (5 points)\n\t* Were the most significant factors that contribute to customer churn identified and discussed? (5 points)\n7. **Model Interpretation (15 points)**\n\t* Were the predicted probabilities of churn for each customer provided? (10 points)\n\t* Were the factors that contribute to these predictions identified and discussed? (5 points)\n8. **Code Quality and Organization (10 points)**\n\t* Was the code well-organized, readable, and maintainable? (5 points)\n\t* Were comments and documentation provided to explain the code? (5 points)\n\n**Additional Requirements:**\n\n1. **Report**: A written report should be provided to explain the approach, results, and insights gained from the project.\n2. **Code**: The code used to develop and train the model should be provided.\n3. **Results**: The results of the model's performance should be provided, including metrics and visualizations.\n\n**Grading Scale:**\n\n* 90-100%: Excellent\n* 80-89%: Good\n* 70-79%: Fair\n* 69% and below: Needs Improvement\n\n**Note:**\nThis observation sheet is designed to evaluate the technical aspects of the project. The grading scale and evaluation criteria can be adjusted according to the specific requirements and expectations of the project."
        }
    ],
    "bhavukprasad2004@gmail.com": [
        {
            "task": "**Certification Task: Data Analysis and Visualization**\n\n**Task Overview:**  \nIn the real world, data analysis and visualization are crucial skills for extracting insights from complex data sets and communicating findings effectively to both technical and non-technical stakeholders. The ability to analyze data, identify trends, and present findings in a clear, concise manner is highly valued across various industries, including business, healthcare, and finance. The objective of this certification task is to assess the candidate's ability to collect, analyze, and visualize data to answer specific business questions. Candidates will be required to demonstrate their skills in data manipulation, statistical analysis, and data visualization using a real-world dataset.\n\n**Dataset/Resources (if applicable):**  \nFor this task, candidates will be provided with a sample dataset containing sales information for an e-commerce company, including variables such as product category, sales region, sales amount, and date. The dataset will be in CSV format and can be accessed through a shared link. Candidates are also allowed to use any publicly available data visualization libraries or tools (e.g., Tableau, Power BI, Python's Matplotlib and Seaborn) to complete the task.\n\n**Task Requirements:**  \n1. **Data Cleaning and Preparation**:  \n* Candidates are required to load the provided dataset into their preferred data analysis tool or programming language (e.g., Python, R).\n* They must then inspect the dataset for any missing or erroneous values and perform necessary data cleaning operations (e.g., handling missing values, data normalization).\n* The cleaned dataset should be saved in a suitable format for further analysis.\n2. **Exploratory Data Analysis (EDA)**:  \n* Candidates should perform EDA to understand the distribution of sales across different product categories and regions.\n* They need to calculate summary statistics (e.g., mean, median, standard deviation) for sales amounts and visualize the distribution of sales using histograms or box plots.\n3. **Hypothesis Testing and Insights Generation**:  \n* Based on the EDA, candidates should formulate a hypothesis regarding the relationship between sales and a specific variable (e.g., product category, region).\n* They must then conduct appropriate statistical tests (e.g., t-test, ANOVA) to validate their hypothesis and draw meaningful insights from the results.\n4. **Data Visualization**:  \n* Candidates are required to create a set of visualizations (e.g., bar charts, scatter plots, heatmaps) to effectively communicate their findings and insights to a business audience.\n* The visualizations should be clear, well-labeled, and provide a comprehensive overview of the sales data and trends.\n\n**Deliverables:**  \n1. **Expected output:**  \n* A written report (max 5 pages) detailing the methodology used for data cleaning, EDA, hypothesis testing, and insights generated.\n* A set of data visualizations (minimum 4) that effectively communicate the findings, along with a brief explanation of each visualization.\n* The report and visualizations should be submitted as separate files (PDF for the report and PNG or interactive dashboards for visualizations).\n2. **Evaluation criteria:**  \n* Clarity and coherence of the written report (20%).\n* Accuracy and completeness of data cleaning and EDA (20%).\n* Appropriateness and correctness of statistical tests and hypothesis formulation (20%).\n* Effectiveness and clarity of data visualizations in communicating insights (20%).\n* Overall presentation and professionalism of the submission (20%).\n\nBy completing this certification task, candidates demonstrate their ability to work with real-world data, apply statistical analysis and data visualization techniques, and communicate complex findings in a clear and concise manner, which are essential skills for a data analyst or scientist in any industry.",
            "invigilator": "John Doe",
            "observation_sheet": "**Observation Sheet: Certification Task - Data Analysis and Visualization**\n\n**Candidate Information:**\n\n* Candidate Name: _____________________________________\n* Date of Submission: _____________________________________\n\n**Task Overview:**\n\nThe candidate is required to collect, analyze, and visualize a sample dataset containing sales information for an e-commerce company to answer specific business questions.\n\n**Evaluation Criteria:**\n\n1. **Clarity and Coherence of the Written Report (20%):**\n\t* Is the report well-organized and easy to follow?\n\t* Are the methodology, results, and insights clearly explained?\n\t* Are the written sections concise and within the 5-page limit?\n2. **Accuracy and Completeness of Data Cleaning and EDA (20%):**\n\t* Were the data loaded and cleaned correctly?\n\t* Were missing or erroneous values identified and handled properly?\n\t* Were summary statistics and visualizations used to understand the distribution of sales?\n3. **Appropriateness and Correctness of Statistical Tests and Hypothesis Formulation (20%):**\n\t* Was a hypothesis formulated based on the EDA results?\n\t* Were appropriate statistical tests conducted to validate the hypothesis?\n\t* Were the results interpreted correctly, and were meaningful insights generated?\n4. **Effectiveness and Clarity of Data Visualizations (20%):**\n\t* Are the visualizations clear, well-labeled, and easy to understand?\n\t* Do the visualizations effectively communicate the findings and insights?\n\t* Are the visualizations comprehensive and provide a thorough overview of the sales data and trends?\n5. **Overall Presentation and Professionalism (20%):**\n\t* Is the report and visualizations well-formatted and visually appealing?\n\t* Are the report and visualizations free of errors and easy to navigate?\n\t* Does the submission demonstrate a professional tone and approach?\n\n**Assessment:**\n\nFor each evaluation criterion, please assign a score based on the following scale:\n\n* Excellent (5): The candidate exceeded expectations and demonstrated exceptional skills.\n* Good (4): The candidate met expectations and demonstrated good skills.\n* Fair (3): The candidate partially met expectations and demonstrated some skills.\n* Needs Improvement (2): The candidate did not meet expectations and demonstrated limited skills.\n* Unsatisfactory (1): The candidate failed to meet expectations and demonstrated minimal or no skills.\n\n**Score:**\n\n1. Clarity and Coherence of the Written Report: _______\n2. Accuracy and Completeness of Data Cleaning and EDA: _______\n3. Appropriateness and Correctness of Statistical Tests and Hypothesis Formulation: _______\n4. Effectiveness and Clarity of Data Visualizations: _______\n5. Overall Presentation and Professionalism: _______\n\n**Total Score:** _______\n\n**Passing Score:** 80% (40/50)\n\n**Feedback:**\n\nPlease provide constructive feedback to the candidate on their strengths and weaknesses, and suggest areas for improvement.\n\n**Recommendation:**\n\nBased on the candidate's performance, do you recommend:\n\n* Passing the certification task\n* Retaking the certification task\n* Additional training or development\n\nSignature: _____________________________________\nDate: _____________________________________"
        },
        {
            "task": "**Certification Task: Cooking Tea**\n\n**Task Description:**\n\nThe goal of this certification task is to evaluate an individual's ability to cook tea according to traditional methods and standards. The task requires the individual to prepare a perfect cup of tea, demonstrating their knowledge of tea varieties, water quality, temperature control, and brewing techniques.\n\n**Task Requirements:**\n\n1. **Tea Selection:** Choose a high-quality tea variety, such as Assam, Darjeeling, or Earl Grey.\n2. **Equipment:** Use a tea kettle, tea infuser, and teapot made of ceramic or glass materials.\n3. **Water Quality:** Use fresh, filtered water with a temperature of 95°C to 100°C (203°F to 212°F).\n4. **Tea Measurement:** Use one teaspoon of loose-leaf tea or one tea bag for every 250ml of water.\n5. **Brewing Time:** Steep the tea for 3 to 5 minutes, depending on the tea variety and personal preference.\n6. **Temperature Control:** Monitor the water temperature and adjust the brewing time accordingly.\n7. **Tea Service:** Serve the tea in a ceramic or glass cup, with optional additions such as milk, sugar, or honey.\n\n**Task Evaluation Criteria:**\n\n1. **Tea Quality:** The tea should be of high quality, with a rich flavor and aroma.\n2. **Brewing Technique:** The brewing technique should be precise, with the correct water temperature, tea measurement, and brewing time.\n3. **Presentation:** The tea should be presented in a clean and attractive manner, with optional additions such as milk, sugar, or honey.\n4. **Safety:** The individual should demonstrate safe handling of hot equipment and liquids.\n\n**Submission Requirements:**\n\nThe certification task can be submitted in one of two formats:\n\n1. **Video File:** Record a video of yourself completing the task, including the tea selection, equipment preparation, brewing process, and tea service. The video should be 5 to 10 minutes long and include a clear narrative of the steps involved.\n2. **Text File:** Write a detailed, step-by-step guide to cooking tea, including the tea selection, equipment preparation, brewing process, and tea service. The text file should include photographs or diagrams to illustrate the steps involved.\n\n**Submission Guidelines:**\n\n1. **File Format:** The video file should be in MP4 format, and the text file should be in Microsoft Word (.docx) or plain text (.txt) format.\n2. **File Size:** The video file should be no larger than 100MB, and the text file should be no larger than 10MB.\n3. **Submission Deadline:** The submission deadline is [insert date and time].\n4. **Contact Information:** The submission should include the individual's name, email address, and phone number.\n\n**Certification Criteria:**\n\nTo achieve certification, the individual must demonstrate a high level of competence in cooking tea, including:\n\n1. **Technical Skills:** The individual should demonstrate technical skills in tea selection, equipment preparation, brewing techniques, and tea service.\n2. **Safety:** The individual should demonstrate safe handling of hot equipment and liquids.\n3. **Attention to Detail:** The individual should demonstrate attention to detail in the brewing process, including the correct water temperature, tea measurement, and brewing time.\n4. **Presentation:** The individual should demonstrate a high level of presentation skills, including the",
            "invigilator": "John Doe",
            "observation_sheet": "**Certification Task: Cooking Tea Observation Sheet**\n\n**Task Overview:**\nThe candidate will be evaluated on their ability to cook tea according to traditional methods and standards.\n\n**Evaluation Criteria:**\n\n1. **Tea Quality** (20 points)\n\t* Is the tea of high quality, with a rich flavor and aroma?\n\t* Is the tea variety suitable for the brewing method?\n2. **Brewing Technique** (30 points)\n\t* Is the water temperature within the correct range (95°C to 100°C)?\n\t* Is the tea measurement correct (one teaspoon of loose-leaf tea or one tea bag for every 250ml of water)?\n\t* Is the brewing time within the correct range (3 to 5 minutes)?\n3. **Presentation** (20 points)\n\t* Is the tea presented in a clean and attractive manner?\n\t* Are optional additions (milk, sugar, or honey) provided?\n4. **Safety** (30 points)\n\t* Does the candidate demonstrate safe handling of hot equipment and liquids?\n\t* Are the equipment and workspace clean and well-maintained?\n\n**Assessment:**\n\n* **Exceeds Expectations** (90-100%): The candidate demonstrates exceptional skills and attention to detail in cooking tea.\n* **Meets Expectations** (80-89%): The candidate demonstrates good skills and attention to detail in cooking tea, with some minor errors.\n* **Needs Improvement** (70-79%): The candidate demonstrates some skills and attention to detail in cooking tea, with noticeable errors.\n* **Fails to Meet Expectations** (Below 70%): The candidate demonstrates poor skills and attention to detail in cooking tea, with significant errors.\n\n**Additional Comments:**\nPlease provide any additional comments or observations about the candidate's performance, including areas of strength and weakness.\n\n**Certification Decision:**\nBased on the evaluation, does the candidate meet the certification criteria?\n\n* Yes\n* No\n\n**Feedback:**\nPlease provide feedback to the candidate on their performance, including suggestions for improvement."
        },
        {
            "task": "**Egg Curry Certification Task**\n\n**Objective:** To assess the candidate's ability to prepare a delicious and authentic egg curry dish, demonstrating their culinary skills and knowledge of Indian cuisine.\n\n**Task Requirements:**\n\n1. **Recipe:** Prepare an egg curry dish using the following ingredients:\n\t* 4-6 eggs, hard-boiled and peeled\n\t* 2 medium onions, chopped\n\t* 2 medium tomatoes, chopped\n\t* 1 teaspoon grated ginger\n\t* 1 teaspoon garlic paste\n\t* 1 teaspoon curry powder\n\t* 1 teaspoon turmeric powder\n\t* 1/2 teaspoon red chili powder\n\t* 1/2 teaspoon garam masala powder\n\t* 1/2 teaspoon salt\n\t* 2 tablespoons vegetable oil\n\t* 2 cups water\n\t* Fresh cilantro, chopped (for garnish)\n2. **Cooking Method:**\n\t* Heat oil in a pan over medium heat and sauté the onions until they turn translucent.\n\t* Add the ginger, garlic, curry powder, turmeric, red chili powder, and garam masala. Cook for 1-2 minutes, stirring constantly.\n\t* Add the chopped tomatoes and cook until they soften and the mixture thickens.\n\t* Add the hard-boiled eggs and cook for 2-3 minutes, stirring gently.\n\t* Add the water and salt, and bring the mixture to a boil.\n\t* Reduce the heat to low and simmer the curry for 10-15 minutes, stirring occasionally.\n3. **Presentation:**\n\t* Garnish the egg curry with chopped cilantro and serve with steamed rice or roti.\n4. **Submission:**\n\t* Candidates can submit their egg curry dish in a .txt file format, including:\n\t\t+ A detailed recipe with ingredients and cooking method.\n\t\t+ A step-by-step guide with photos or illustrations.\n\t\t+ A brief description of the dish, including its origin and cultural significance.\n\t* Alternatively, candidates can submit a video file (MP4 or AVI format) showcasing their cooking process, including:\n\t\t+ Introduction to the dish and its ingredients.\n\t\t+ Step-by-step cooking demonstration.\n\t\t+ final presentation and garnishing.\n\t* The video should be 10-15 minutes long and include a clear audio commentary.\n\n**Evaluation Criteria:**\n\n1. **Taste and Flavor:** The egg curry should have a rich, creamy flavor with a balance of spices.\n2. **Presentation:** The dish should be visually appealing, with a garnish of chopped cilantro and a neat presentation.\n3. **Cooking Technique:** The candidate should demonstrate a good understanding of cooking techniques, including sautéing, boiling, and simmering.\n4. **Recipe Authenticity:** The candidate should provide a traditional egg curry recipe, with accurate measurements and cooking instructions.\n5. **Communication Skills:** The candidate should provide clear and concise instructions, both in the written recipe and video commentary.\n\n**Certification Requirements:**\n\nTo achieve certification, candidates must:\n\n1. Submit a complete and accurate recipe with cooking instructions.\n2. Demonstrate a good understanding of cooking techniques and ingredients.\n3. Present a visually appealing dish with a garnish of chopped cilantro.\n4. Showcase their cooking process in a clear and concise video commentary (if submitting a video file).\n5. Meet the evaluation criteria, with a",
            "invigilator": "John Doe",
            "observation_sheet": "**Egg Curry Certification Task Observation Sheet**\n\n**Candidate Information:**\n* Name: _____________________________________________________\n* Submission Type: (Check one) Written Recipe (.txt file) / Video File (MP4 or AVI format)\n\n**Evaluation Criteria:**\n\n1. **Taste and Flavor:**\n\t* Does the egg curry have a rich, creamy flavor with a balance of spices? (Yes/No)\n\t* Are the flavors well-balanced and authentic? (Yes/No)\n\t* Comments: _____________________________________________________\n2. **Presentation:**\n\t* Is the dish visually appealing? (Yes/No)\n\t* Is the garnish of chopped cilantro neat and well-presented? (Yes/No)\n\t* Comments: _____________________________________________________\n3. **Cooking Technique:**\n\t* Does the candidate demonstrate a good understanding of cooking techniques, including sautéing, boiling, and simmering? (Yes/No)\n\t* Are the cooking instructions clear and concise? (Yes/No)\n\t* Comments: _____________________________________________________\n4. **Recipe Authenticity:**\n\t* Is the recipe traditional and authentic? (Yes/No)\n\t* Are the ingredients and measurements accurate? (Yes/No)\n\t* Comments: _____________________________________________________\n5. **Communication Skills:**\n\t* Are the written instructions clear and concise? (Yes/No)\n\t* Is the video commentary (if applicable) clear and easy to follow? (Yes/No)\n\t* Comments: _____________________________________________________\n\n**Certification Requirements:**\n\n1. **Complete and Accurate Recipe:**\n\t* Is the recipe complete and accurate? (Yes/No)\n\t* Are the cooking instructions clear and concise? (Yes/No)\n2. **Cooking Techniques and Ingredients:**\n\t* Does the candidate demonstrate a good understanding of cooking techniques and ingredients? (Yes/No)\n3. **Presentation:**\n\t* Is the dish visually appealing and well-presented? (Yes/No)\n4. **Video Commentary (if applicable):**\n\t* Is the video commentary clear and concise? (Yes/No)\n\t* Does the candidate showcase their cooking process effectively? (Yes/No)\n5. **Evaluation Criteria:**\n\t* Does the candidate meet the evaluation criteria, with a score of 80% or higher? (Yes/No)\n\n**Scoring:**\n\n* Taste and Flavor: __/20\n* Presentation: __/20\n* Cooking Technique: __/20\n* Recipe Authenticity: __/20\n* Communication Skills: __/20\n* Total Score: __/100\n\n**Certification Status:**\n\n* Certified: (Yes/No)\n* Feedback and Recommendations for Improvement: _____________________________________________________\n\n**Evaluator's Comments:**\n\n* _____________________________________________________\n* _____________________________________________________\n* _____________________________________________________"
        },
        {
            "task": "**Certification Task: School Project Presentation**\n\n**Task Description:**\nCreate a comprehensive school project presentation on a topic of your choice, incorporating research, data analysis, and visual aids. The presentation should demonstrate your understanding of the topic, ability to collect and analyze data, and effective communication skills.\n\n**Requirements:**\n\n1. **Topic Selection:** Choose a topic that interests you and is relevant to your school curriculum. Some examples include:\n\t* Environmental conservation\n\t* Historical events\n\t* Scientific discoveries\n\t* Social issues\n\t* Literary analysis\n2. **Research and Data Collection:** Conduct thorough research on your chosen topic, gathering data from credible sources such as:\n\t* Academic journals\n\t* Books\n\t* Government reports\n\t* Online databases\n\t* Primary sources (e.g., interviews, surveys)\n3. **Data Analysis:** Analyze the collected data, identifying patterns, trends, and correlations. Use statistical methods and data visualization techniques to support your arguments.\n4. **Presentation Structure:** Organize your presentation into the following sections:\n\t* Introduction (2-3 minutes)\n\t\t+ Introduce the topic and its significance\n\t\t+ Provide a thesis statement or research question\n\t* Literature Review (4-5 minutes)\n\t\t+ Summarize existing research on the topic\n\t\t+ Identify gaps in current knowledge\n\t* Methodology (2-3 minutes)\n\t\t+ Describe your data collection methods\n\t\t+ Explain your data analysis techniques\n\t* Results (4-5 minutes)\n\t\t+ Present your findings, using visual aids such as charts, graphs, and tables\n\t\t+ Discuss the implications of your results\n\t* Conclusion (2-3 minutes)\n\t\t+ Summarize your main points\n\t\t+ Reiterate your thesis statement or research question\n\t\t+ Provide recommendations for future research or action\n5. **Visual Aids:** Incorporate a variety of visual aids to enhance your presentation, such as:\n\t* PowerPoint slides\n\t* Videos\n\t* Images\n\t* Infographics\n\t* Diagrams\n6. **Presentation Style:** Deliver your presentation in a clear, concise, and engaging manner, using:\n\t* Proper body language\n\t* Eye contact\n\t* Vocal variation\n\t* Pauses for emphasis\n7. **Submission Format:** You can submit your presentation in either of the following formats:\n\t* **Text File (.txt):** Write a detailed script of your presentation, including Introduction, Literature Review, Methodology, Results, and Conclusion. Ensure that your script is well-organized, easy to follow, and free of grammatical errors.\n\t* **Video File:** Record a video of your presentation, using a camera or screen recording software. Ensure that your video is:\n\t\t+ Clear and audible\n\t\t+ Well-lit\n\t\t+ Free of background noise\n\t\t+ Between 10-15 minutes long\n\n**Evaluation Criteria:**\n\n1. Content (40%):\n\t* Depth and breadth of research\n\t* Accuracy and relevance of data\n\t* Clarity and coherence of arguments\n2. Organization and Structure (20%):\n\t* Logical flow of ideas\n\t* Effective use of transitions and connectors\n\t* Adherence to the presentation structure\n3. Visual Aids and Presentation Style (20%):\n\t* Effectiveness of visual aids in supporting arguments\n\t* Clarity",
            "invigilator": "John Doe",
            "observation_sheet": "**Observation Sheet: School Project Presentation Evaluation**\n\n**Student Name:** _____________________________________\n**Topic:** _____________________________________________\n\n**Evaluation Criteria:**\n\n1. **Content (40%):**\n\t* Depth and breadth of research: \n\t\t+ (4) Excellent: Research is thorough, in-depth, and covers a wide range of relevant topics.\n\t\t+ (3) Good: Research is good, but may lack depth or breadth in some areas.\n\t\t+ (2) Fair: Research is limited, lacking in depth or breadth.\n\t\t+ (1) Poor: Research is insufficient, lacking in both depth and breadth.\n\t* Accuracy and relevance of data: \n\t\t+ (4) Excellent: Data is accurate, relevant, and well-integrated into the presentation.\n\t\t+ (3) Good: Data is mostly accurate and relevant, but may have some minor errors.\n\t\t+ (2) Fair: Data is somewhat inaccurate or irrelevant.\n\t\t+ (1) Poor: Data is largely inaccurate or irrelevant.\n\t* Clarity and coherence of arguments: \n\t\t+ (4) Excellent: Arguments are clear, logical, and well-supported.\n\t\t+ (3) Good: Arguments are mostly clear, but may lack some logic or support.\n\t\t+ (2) Fair: Arguments are somewhat unclear or lack coherence.\n\t\t+ (1) Poor: Arguments are unclear, illogical, or lack coherence.\n\tTotal Content Score: _______/40\n\n2. **Organization and Structure (20%):**\n\t* Logical flow of ideas: \n\t\t+ (4) Excellent: Ideas are well-organized, logical, and easy to follow.\n\t\t+ (3) Good: Ideas are mostly well-organized, but may have some minor issues.\n\t\t+ (2) Fair: Ideas are somewhat disorganized or difficult to follow.\n\t\t+ (1) Poor: Ideas are poorly organized, lacking in logic or coherence.\n\t* Effective use of transitions and connectors: \n\t\t+ (4) Excellent: Transitions and connectors are effective, smooth, and well-executed.\n\t\t+ (3) Good: Transitions and connectors are mostly effective, but may have some minor issues.\n\t\t+ (2) Fair: Transitions and connectors are somewhat ineffective.\n\t\t+ (1) Poor: Transitions and connectors are largely ineffective.\n\t* Adherence to the presentation structure: \n\t\t+ (4) Excellent: Presentation follows the required structure, with all sections included.\n\t\t+ (3) Good: Presentation mostly follows the required structure, but may have some minor deviations.\n\t\t+ (2) Fair: Presentation has some significant deviations from the required structure.\n\t\t+ (1) Poor: Presentation does not follow the required structure.\n\tTotal Organization and Structure Score: _______/20\n\n3. **Visual Aids and Presentation Style (20%):**\n\t* Effectiveness of visual aids in supporting arguments: \n\t\t+ (4) Excellent: Visual aids are effective, well-designed, and support arguments well.\n\t\t+ (3) Good: Visual aids are mostly effective, but may have some minor issues.\n\t\t+ (2) Fair: Visual aids are somewhat ineffective.\n\t\t+ (1) Poor: Visual aids are largely ineffective.\n\t* Clarity in presentation style: \n\t\t+ (4) Excellent:"
        },
        {
            "task": "\n    TASK DEADLINE: 2025-04-17 (30 days)\n    \n    **Certification Task: Python Data Analysis and Visualization**\n\n**Objective:**\nThe objective of this certification task is to assess the candidate's ability to collect, analyze, and visualize data using Python. The candidate is expected to demonstrate proficiency in data manipulation, statistical analysis, and data visualization techniques.\n\n**Requirements:**\n\n1. **Dataset:** The candidate will be provided with a dataset containing information about customer purchases from an e-commerce website. The dataset will include columns for customer ID, purchase date, product category, product name, and purchase amount.\n2. **Task:** The candidate is required to analyze the dataset and create visualizations to answer the following questions:\n\t* What is the total purchase amount by product category?\n\t* Which product category has the highest average purchase amount?\n\t* What is the distribution of purchase amounts by product category?\n\t* How does the purchase amount vary by month?\n3. **Tools and Libraries:** The candidate is expected to use the following Python libraries:\n\t* Pandas for data manipulation and analysis\n\t* NumPy for numerical computations\n\t* Matplotlib and/or Seaborn for data visualization\n4. **Submission Format:** The candidate can submit their solution in either a .txt file or a video file (MP4 format). If submitting a .txt file, the candidate should include:\n\t* A brief introduction to the problem and the approach used\n\t* The Python code used to analyze and visualize the data\n\t* Screenshots of the visualizations created\n\t* A conclusion summarizing the findings\nIf submitting a video file, the candidate should:\n\t* Create a video walkthrough of the solution, explaining the approach and code used\n\t* Include screenshots of the visualizations created\n\t* Provide a clear and concise narration of the findings\n\n**Expected Deliverables:**\n\n1. **Code:** The candidate is expected to provide well-structured, readable, and well-documented Python code that analyzes and visualizes the dataset.\n2. **Visualizations:** The candidate is expected to create at least four visualizations that answer the questions listed in the requirements section.\n3. **Insights:** The candidate is expected to provide a clear and concise summary of the findings, including any trends or patterns observed in the data.\n\n**Evaluation Criteria:**\n\n1. **Code Quality (30%):** The candidate's code will be evaluated for readability, structure, and adherence to best practices.\n2. **Data Analysis (30%):** The candidate's ability to analyze the data and extract insights will be evaluated.\n3. **Data Visualization (20%):** The candidate's visualizations will be evaluated for clarity, effectiveness, and aesthetics.\n4. **Communication (20%):** The candidate's ability to communicate the findings and insights will be evaluated, including the clarity and concision of the written or video submission.\n\n**Grading Scale:**\n\n* 90-100%: Excellent\n* 80-89%: Good\n* 70-79%: Fair\n* 69% and below: Needs Improvement\n\nNote: The certification task is designed to assess the candidate's skills and knowledge in Python data analysis and visualization. The task is open-ended, and the candidate is expected to demonstrate creativity and critical thinking in their solution.\n    \n    Please ensure to complete and submit this task before the deadline.\n    Late submissions may affect evaluation.\n    ",
            "invigilator": "John Doe",
            "observation_sheet": "**Certification Task: Python Data Analysis and Visualization Observation Sheet**\n\n**Candidate Information:**\n\n* Name: _____________________________________\n* Submission Format: (.txt file or video file)\n\n**Evaluation Criteria:**\n\n1. **Code Quality (30%):**\n\t* Is the code well-structured and readable?\n\t* Are the code comments clear and concise?\n\t* Does the code adhere to best practices?\n2. **Data Analysis (30%):**\n\t* Does the candidate demonstrate proficiency in data manipulation and statistical analysis?\n\t* Are the insights extracted from the data accurate and relevant?\n3. **Data Visualization (20%):**\n\t* Are the visualizations clear, effective, and aesthetically pleasing?\n\t* Do the visualizations answer the questions listed in the requirements section?\n4. **Communication (20%):**\n\t* Is the written or video submission clear and concise?\n\t* Are the findings and insights communicated effectively?\n\n**Expected Deliverables:**\n\n1. **Code:**\n\t* Is the code provided and well-documented?\n2. **Visualizations:**\n\t* Are at least four visualizations created to answer the questions?\n3. **Insights:**\n\t* Is a clear and concise summary of the findings provided?\n\n**Grading Scale:**\n\n* 90-100%: Excellent\n* 80-89%: Good\n* 70-79%: Fair\n* 69% and below: Needs Improvement\n\n**Score:**\n\n* Code Quality: _______/30\n* Data Analysis: _______/30\n* Data Visualization: _______/20\n* Communication: _______/20\n* Total: _______/100\n\n**Feedback and Comments:**\n\n* Strengths: _____________________________________________________\n* Weaknesses: _____________________________________________________\n* Suggestions for improvement: _____________________________________________________"
        },
        {
            "task": "\n    TASK DEADLINE: 2025-04-18 (30 days)\n    \n    **Certification Task: C++ Programming**\n\n**Objective:**\nThe objective of this certification task is to assess the candidate's skills in C++ programming, focusing on their ability to design, develop, and test a console-based application. The task aims to evaluate the candidate's understanding of C++ fundamentals, data structures, file handling, and error handling.\n\n**Task Description:**\nCreate a console-based application in C++ that simulates a simple library management system. The system should allow users to perform the following operations:\n\n1. Add a book to the library\n2. Remove a book from the library\n3. Search for a book by title or author\n4. Display all books in the library\n5. Save and load the library data from a file\n\n**Requirements:**\n\n1. The application should use a `Book` struct to represent a book, containing the following members:\n\t* `title`: a string representing the book title\n\t* `author`: a string representing the book author\n\t* `isbn`: a string representing the book ISBN\n2. The application should use a `Library` class to manage the collection of books, containing the following methods:\n\t* `addBook`: adds a new book to the library\n\t* `removeBook`: removes a book from the library by ISBN\n\t* `searchBook`: searches for a book by title or author\n\t* `displayBooks`: displays all books in the library\n\t* `saveData`: saves the library data to a file\n\t* `loadData`: loads the library data from a file\n3. The application should handle errors and exceptions properly, such as:\n\t* Invalid input (e.g., empty title or author)\n\t* Duplicate ISBN\n\t* Book not found\n4. The application should use a file to store and retrieve the library data, with the following format:\n\t* Each book is represented by a single line in the file, containing the title, author, and ISBN, separated by commas\n\n**Expected Deliverables:**\n\n1. A fully functional console-based application in C++ that meets the requirements and objectives of the task\n2. A `README.txt` file containing:\n\t* A brief description of the application and its functionality\n\t* Instructions on how to compile and run the application\n\t* A list of any assumptions or limitations made during the development process\n3. A video file (e.g., MP4) demonstrating the application's functionality, including:\n\t* Adding a book to the library\n\t* Removing a book from the library\n\t* Searching for a book by title or author\n\t* Displaying all books in the library\n\t* Saving and loading the library data from a file\n\n**Evaluation Criteria:**\n\n1. Correctness and completeness of the application (40%)\n2. Code quality, readability, and maintainability (30%)\n3. Error handling and exception management (15%)\n4. User interface and user experience (10%)\n5. Adherence to the requirements and guidelines (5%)\n\n**Submission Format:**\nThe candidate can submit the certification task as a single `.zip` file containing:\n\n* The C++ source code files (`.cpp` and `.h`)\n* The `README.txt` file\n* The video file (e.g., `demo.mp4`)\n\nAlternatively, the candidate can submit a video file (e.g., `submission.mp4`) containing a recorded demo of the\n    \n    Please ensure to complete and submit this task before the deadline.\n    Late submissions may affect evaluation.\n    ",
            "invigilator": "Rutvik",
            "observation_sheet": "**Certification Task: C++ Programming Observation Sheet**\n\n**Candidate Information:**\n- Name: _____________________________________\n- Date: _____________________________________\n\n**Task Description:**\nThe candidate is required to create a console-based application in C++ that simulates a simple library management system.\n\n**Observation Checklist:**\n\n1. **Correctness and Completeness (40%):**\n\t* Does the application allow users to add a book to the library?\n\t* Does the application allow users to remove a book from the library?\n\t* Does the application allow users to search for a book by title or author?\n\t* Does the application display all books in the library?\n\t* Does the application save and load the library data from a file?\n\t* Are all requirements met?\n\n2. **Code Quality, Readability, and Maintainability (30%):**\n\t* Is the code well-organized and structured?\n\t* Are the variables and functions named clearly and consistently?\n\t* Are comments used to explain the code?\n\t* Is the code concise and efficient?\n\n3. **Error Handling and Exception Management (15%):**\n\t* Does the application handle invalid input (e.g., empty title or author)?\n\t* Does the application handle duplicate ISBN?\n\t* Does the application handle book not found errors?\n\t* Are errors handled properly and user-friendly error messages displayed?\n\n4. **User Interface and User Experience (10%):**\n\t* Is the user interface clear and intuitive?\n\t* Are the menu options and instructions clear?\n\t* Is the application easy to use and navigate?\n\n5. **Adherence to Requirements and Guidelines (5%):**\n\t* Does the application use a `Book` struct with the required members?\n\t* Does the application use a `Library` class with the required methods?\n\t* Is the file format for storing and retrieving library data correct?\n\n**Additional Comments:**\n______________________________________________________________________\n______________________________________________________________________\n______________________________________________________________________\n\n**Evaluation Score:**\n\n1. Correctness and Completeness: _______/40\n2. Code Quality, Readability, and Maintainability: _______/30\n3. Error Handling and Exception Management: _______/15\n4. User Interface and User Experience: _______/10\n5. Adherence to Requirements and Guidelines: _______/5\n\n**Total Score:** _______/100\n\n**Pass/Fail:**\nPass: _______\nFail: _______\n\n**Recommendations for Improvement:**\n______________________________________________________________________\n______________________________________________________________________\n______________________________________________________________________"
        }
    ],
    "rutvikkirtika@gmail.com": [
        {
            "task": "**Maggie Cooking Certification Task**\n\n**Objective:** To demonstrate the ability to cook Maggie noodles according to the package instructions and basic cooking standards.\n\n**Task Requirements:**\n\n1. **Submission Format:** The submission can be either a .txt file or a video file (MP4 format).\n2. **Cooking Environment:** The cooking task must be performed in a safe and clean kitchen environment.\n3. **Ingredients and Equipment:**\n\t* Maggie noodles (1 packet)\n\t* Water (2 cups)\n\t* Saucepan\n\t* Stovetop or electric stove\n\t* Spoon or stirring utensil\n\t* Plate or serving dish\n4. **Cooking Instructions:**\n\t* Boil 2 cups of water in the saucepan.\n\t* Add the Maggie noodles to the boiling water.\n\t* Cook the noodles for 2-3 minutes or until they are tender.\n\t* Remove the saucepan from the heat source.\n\t* Add the seasoning packet (provided with the Maggie noodles) to the cooked noodles.\n\t* Stir the noodles and seasoning mixture well.\n5. **Certification Requirements:**\n\t* The cooked Maggie noodles must be presented on a clean plate or serving dish.\n\t* The noodles must be cooked to a safe internal temperature of at least 165°F (74°C).\n\t* The seasoning packet must be fully incorporated into the noodles.\n6. **Submission Guidelines:**\n\t* If submitting a .txt file, please provide a step-by-step description of the cooking process, including the ingredients and equipment used, and the final presentation of the cooked Maggie noodles.\n\t* If submitting a video file, please record the entire cooking process, from boiling the water to presenting the cooked noodles. The video must be at least 5 minutes long and include a clear view of the cooking process.\n\n**Evaluation Criteria:**\n\n1. **Cooking Technique:** The ability to follow the package instructions and basic cooking standards.\n2. **Food Safety:** The cooked noodles must be presented at a safe internal temperature.\n3. **Presentation:** The cooked noodles must be presented in a clean and visually appealing manner.\n4. **Attention to Detail:** The ability to follow the submission guidelines and requirements.\n\n**Certification Levels:**\n\n1. **Basic Certification:** Demonstrates the ability to cook Maggie noodles according to the package instructions.\n2. **Advanced Certification:** Demonstrates the ability to cook Maggie noodles with additional ingredients or variations, such as adding vegetables or spices.\n3. **Master Certification:** Demonstrates expertise in cooking Maggie noodles with complex variations and presentations.\n\n**Submission Deadline:** The submission must be received within 7 days of the task assignment.\n\n**Note:** The certification task is designed to assess the ability to cook Maggie noodles according to basic cooking standards. The task requirements and evaluation criteria are subject to change based on the specific needs and requirements of the certification program.",
            "invigilator": "John Doe",
            "observation_sheet": "**Maggie Cooking Certification Task Observation Sheet**\n\n**Task Information:**\n- Task: Maggie Cooking Certification Task\n- Objective: Demonstrate the ability to cook Maggie noodles according to package instructions and basic cooking standards.\n\n**Evaluation Criteria:**\n\n1. **Cooking Technique**\n   - Able to boil water correctly: Yes/No\n   - Added Maggie noodles correctly: Yes/No\n   - Cooked noodles for the correct time: Yes/No\n   - Removed saucepan from heat source correctly: Yes/No\n   - Added seasoning packet correctly: Yes/No\n   - Stirred noodles and seasoning mixture well: Yes/No\n\n2. **Food Safety**\n   - Presented at a safe internal temperature (at least 165°F/74°C): Yes/No\n   - Used clean equipment and environment: Yes/No\n\n3. **Presentation**\n   - Presented on a clean plate or serving dish: Yes/No\n   - Visually appealing: Yes/No\n\n4. **Attention to Detail**\n   - Followed submission guidelines: Yes/No\n   - Included all required information/equipment: Yes/No\n\n**Certification Levels:**\n- Basic: Meets all basic cooking standards\n- Advanced: Demonstrates ability to add variations (e.g., vegetables, spices)\n- Master: Demonstrates expertise with complex variations and presentations\n\n**Submission Details:**\n- Type of submission (txt/video): _____________________\n- Date and time of submission: _______________________\n- Any additional notes or comments: _______________________\n\n**Evaluator's Comments and Recommendations:**\n- _____________________________________________________\n- _____________________________________________________\n- _____________________________________________________"
        },
        {
            "task": "**Maggie Cooking Certification Task**\n\n**Task Objective:**\nTo demonstrate the ability to cook Maggie noodles according to the package instructions and basic culinary standards.\n\n**Task Requirements:**\n\n1. **Ingredients and Equipment:**\n\t* 1 package of Maggie noodles\n\t* 1 liter of water\n\t* 1 saucepan\n\t* 1 stove or cooktop\n\t* 1 spoon or stirrer\n\t* 1 plate or bowl\n2. **Cooking Process:**\n\t* Boil 1 liter of water in the saucepan.\n\t* Add the Maggie noodle package contents to the boiling water.\n\t* Cook for 2-3 minutes or until the noodles are cooked through.\n\t* Stir occasionally to prevent sticking.\n\t* Remove from heat and let it stand for 1 minute.\n3. **Presentation:**\n\t* Transfer the cooked noodles to a plate or bowl.\n\t* Add any desired seasonings or toppings (optional).\n4. **Submission:**\n\t* Create a video recording of the cooking process (maximum 5 minutes duration).\n\t* The video should include:\n\t\t+ Introduction: Introduce yourself and the task objective.\n\t\t+ Cooking Process: Record the cooking process, including boiling water, adding noodles, and stirring.\n\t\t+ Presentation: Record the presentation of the cooked noodles.\n\t* Save the video in MP4 format and upload it to a file-sharing platform.\n\t* Alternatively, write a detailed step-by-step guide in a .txt file, including photos of each step (if possible).\n\n**Evaluation Criteria:**\n\n1. **Cooking Technique:** (30 points)\n\t* Ability to boil water and cook noodles according to package instructions.\n\t* Proper use of equipment and utensils.\n2. **Presentation:** (20 points)\n\t* Visual appeal of the cooked noodles.\n\t* Creativity in presentation (if desired).\n3. **Food Safety and Hygiene:** (20 points)\n\t* Cleanliness of equipment and utensils.\n\t* Proper handling of ingredients.\n4. **Communication:** (30 points)\n\t* Clarity and concision in video or written submission.\n\t* Ability to follow instructions and meet task requirements.\n\n**Certification:**\nUpon successful completion of the task, the candidate will be awarded a \"Maggie Cooking Certification\" certificate, which will be valid for a period of 1 year.\n\n**Submission Guidelines:**\n\n* Video file: Upload the video to a file-sharing platform (e.g., YouTube, Google Drive, Dropbox) and share the link.\n* .txt file: Upload the .txt file to a file-sharing platform and share the link.\n* Include your name, email address, and a brief introduction in the submission.\n\n**Deadline:**\nThe submission should be completed within 7 days of receiving the task assignment.\n\nBy completing this task, you demonstrate your ability to follow instructions, cook Maggie noodles, and present a simple dish. Good luck!",
            "invigilator": "John Doe",
            "observation_sheet": "Observation Sheet: Maggie Cooking Certification Task\n\n**Candidate Information:**\nName: _____________________________________\nEmail: _____________________________________\n\n**Task Requirements:**\n1. Ingredients and Equipment: \n    * 1 package of Maggie noodles\n    * 1 liter of water\n    * 1 saucepan\n    * 1 stove or cooktop\n    * 1 spoon or stirrer\n    * 1 plate or bowl\n\n2. Cooking Process: \n    * Boil 1 liter of water in the saucepan.\n    * Add the Maggie noodle package contents to the boiling water.\n    * Cook for 2-3 minutes or until the noodles are cooked through.\n    * Stir occasionally to prevent sticking.\n    * Remove from heat and let it stand for 1 minute.\n\n3. Presentation: \n    * Transfer the cooked noodles to a plate or bowl.\n    * Add any desired seasonings or toppings (optional).\n\n**Evaluation Criteria:**\n\n1. **Cooking Technique (30 points)**\n    * Ability to boil water and cook noodles: \n    * Proper use of equipment and utensils: \n\n2. **Presentation (20 points)**\n    * Visual appeal of the cooked noodles: \n    * Creativity in presentation: \n\n3. **Food Safety and Hygiene (20 points)**\n    * Cleanliness of equipment and utensils: \n    * Proper handling of ingredients: \n\n4. **Communication (30 points)**\n    * Clarity and concision in video or written submission: \n    * Ability to follow instructions and meet task requirements: \n\n**Certification:**\nUpon successful completion of the task, the candidate will be awarded a \"Maggie Cooking Certification\" certificate, valid for 1 year.\n\n**Submission Guidelines:**\nUpload video or .txt file to a file-sharing platform and share the link. Include name, email, and introduction in the submission.\n\n**Deadline:**\nSubmission should be completed within 7 days of receiving the task assignment.\n\n**Assessment:**\nTotal Score: _______/100\nPass/Fail: _______\nFeedback: _____________________________________________________"
        },
        {
            "task": "**Maggie Cooking Certification Task**\n\n**Task Overview:**\nThe objective of this certification task is to demonstrate your ability to cook Maggie noodles according to the standard recipe and guidelines. The task requires you to prepare a perfectly cooked Maggie dish, following all the necessary steps and safety precautions.\n\n**Task Requirements:**\n\n1. **Ingredients and Equipment:**\n\t* 1 package of Maggie noodles\n\t* 2 cups of water\n\t* 1 tablespoon of vegetable oil\n\t* 1 small onion, finely chopped\n\t* 1 small tomato, finely chopped\n\t* Salt, to taste\n\t* Optional: any additional ingredients of your choice (e.g., vegetables, meat, spices)\n\t* Cooking pot with a lid\n\t* Colander or strainer\n\t* Spoon and fork for serving\n2. **Step-by-Step Instructions:**\n\t* Fill the cooking pot with 2 cups of water and bring it to a boil.\n\t* Add 1 tablespoon of vegetable oil to the boiling water.\n\t* Add the chopped onion and tomato to the pot and sauté for 1-2 minutes.\n\t* Add the Maggie noodles to the pot, making sure they are fully submerged in the water.\n\t* Cook the noodles for 2-3 minutes, or according to the package instructions.\n\t* Remove the pot from the heat source and let it stand for 1 minute.\n\t* Drain the water from the pot using a colander or strainer.\n\t* Add salt to taste and mix well.\n\t* Serve the Maggie noodles hot, garnished with any additional ingredients of your choice.\n3. **Food Safety and Hygiene:**\n\t* Ensure that all utensils and equipment are clean and sanitized before use.\n\t* Wash your hands thoroughly with soap and water before starting the cooking process.\n\t* Use a clean and sanitized surface for food preparation.\n\t* Handle the cooked noodles and ingredients safely to prevent cross-contamination.\n4. **Submission Requirements:**\n\t* Create a video file (MP4 or AVI format) showcasing your Maggie cooking process, from preparation to serving.\n\t* The video should be at least 5 minutes long and include a clear view of the cooking process, ingredients, and equipment used.\n\t* Upload the video file to a cloud storage platform (e.g., Google Drive, Dropbox) and share the link with the certification authority.\n\t* Alternatively, you can submit a detailed text file (DOCX or PDF format) describing the cooking process, including step-by-step instructions, ingredients, and equipment used.\n\n**Evaluation Criteria:**\n\n1. **Cooking Technique:** (30 points)\n\t* Ability to follow the standard recipe and guidelines.\n\t* Correct use of ingredients, equipment, and cooking techniques.\n2. **Food Safety and Hygiene:** (20 points)\n\t* Adherence to food safety and hygiene guidelines.\n\t* Cleanliness and sanitation of utensils, equipment, and cooking surface.\n3. **Presentation and Serving:** (20 points)\n\t* Visual appeal of the final dish.\n\t* Correct use of garnishes and additional ingredients.\n4. **Overall Quality:** (30 points)\n\t* Taste, texture, and flavor of the final dish.\n\t* Ability to cook Maggie noodles according to the standard recipe.\n\n**Certification Levels:**\n\n1. **Basic:** 60-69%\n\t* Demonstrate basic cooking skills and knowledge of food",
            "invigilator": "John Doe",
            "observation_sheet": "**Maggie Cooking Certification Task Observation Sheet**\n\n**Candidate Information:**\n\n* Name: _____________________________________________\n* Certification Level: __________________________________\n\n**Task Requirements:**\n\n1. **Ingredients and Equipment:**\n\t* Were all required ingredients and equipment used? (Yes/No)\n\t* Were any additional ingredients used? (Yes/No) If yes, list: _______________________________________\n2. **Step-by-Step Instructions:**\n\t* Were the instructions followed correctly? (Yes/No)\n\t* Were any steps omitted or modified? (Yes/No) If yes, describe: _______________________________________\n3. **Food Safety and Hygiene:**\n\t* Were all utensils and equipment clean and sanitized before use? (Yes/No)\n\t* Were hands washed thoroughly with soap and water before starting the cooking process? (Yes/No)\n4. **Submission Requirements:**\n\t* Was the video/file submission in the correct format? (Yes/No)\n\t* Was the video/file at least 5 minutes long? (Yes/No)\n\n**Evaluation Criteria:**\n\n1. **Cooking Technique:** (30 points)\n\t* Ability to follow the standard recipe and guidelines: _______/10\n\t* Correct use of ingredients, equipment, and cooking techniques: _______/10\n\t* Correct cooking time and temperature: _______/10\n\tTotal: _______/30\n2. **Food Safety and Hygiene:** (20 points)\n\t* Adherence to food safety and hygiene guidelines: _______/10\n\t* Cleanliness and sanitation of utensils, equipment, and cooking surface: _______/10\n\tTotal: _______/20\n3. **Presentation and Serving:** (20 points)\n\t* Visual appeal of the final dish: _______/10\n\t* Correct use of garnishes and additional ingredients: _______/10\n\tTotal: _______/20\n4. **Overall Quality:** (30 points)\n\t* Taste, texture, and flavor of the final dish: _______/15\n\t* Ability to cook Maggie noodles according to the standard recipe: _______/15\n\tTotal: _______/30\n\n**Total Score:** _______/100\n\n**Certification Level:**\n\n* Basic: 60-69%\n* Intermediate: 70-79%\n* Advanced: 80-89%\n* Expert: 90-100%\n\n**Feedback and Comments:**\n\n* Strengths: _____________________________________________________\n* Areas for improvement: _____________________________________________________\n* Suggestions for future improvement: _____________________________________________________\n\n**Certification Status:**\n\n* Certified: Yes/No\n* Certification Level: _______________________________________\n* Date of Certification: _____________________________________________"
        },
        {
            "task": "**Maggie Cooking Certification Task**\n\n**Task Description:**\nCreate a step-by-step guide on how to prepare a delicious and authentic Maggie dish, specifically Maggie Chicken Noodles. The guide should include a detailed recipe, cooking instructions, and tips for presentation.\n\n**Task Requirements:**\n\n1. **Recipe:**\nThe recipe should include the following ingredients:\n\t* 1 package of Maggie Chicken Noodles\n\t* 2 cups of water\n\t* 1 tablespoon of vegetable oil\n\t* 1 small onion, diced\n\t* 2 cloves of garlic, minced\n\t* 1 cup of mixed vegetables (e.g., carrots, green beans, corn)\n\t* 1 teaspoon of soy sauce\n\t* Salt and pepper to taste\n2. **Cooking Instructions:**\nThe cooking instructions should include the following steps:\n\t* Boil the water and add the Maggie Chicken Noodles. Cook according to the package instructions.\n\t* Heat the vegetable oil in a pan and sauté the diced onion and minced garlic until softened.\n\t* Add the mixed vegetables and cook until they are tender-crisp.\n\t* Add the cooked noodles to the pan and stir in the soy sauce. Season with salt and pepper to taste.\n3. **Presentation:**\nThe presentation should include the following:\n\t* Transfer the Maggie Chicken Noodles to a serving dish.\n\t* Garnish with chopped scallions, green onions, or sesame seeds.\n\t* Serve hot and enjoy!\n\n**Submission Format:**\nThe submission can be either a .txt file or a video file.\n\n**.txt File Submission:**\n\n* The .txt file should include the recipe, cooking instructions, and presentation tips in a clear and concise format.\n* The file should be named \"Maggie_Cooking_Guide.txt\" and should not exceed 2MB in size.\n* The file should be submitted as an attachment to an email with the subject \"Maggie Cooking Certification Task Submission\".\n\n**Video File Submission:**\n\n* The video file should be a step-by-step guide on how to prepare the Maggie Chicken Noodles.\n* The video should be recorded in a well-lit kitchen with clear audio and video quality.\n* The video should be uploaded to a video sharing platform (e.g., YouTube, Vimeo) and the link should be submitted via email with the subject \"Maggie Cooking Certification Task Submission\".\n* The video should not exceed 10 minutes in length and should be in a format that can be played on most devices (e.g., MP4, AVI).\n\n**Certification Criteria:**\nTo pass the certification task, the submission should meet the following criteria:\n\n* The recipe and cooking instructions should be clear, concise, and easy to follow.\n* The presentation should be visually appealing and appetizing.\n* The submission should demonstrate a good understanding of cooking techniques and kitchen safety.\n* The submission should be well-organized and easy to understand.\n\n**Grading:**\nThe submission will be graded based on the following criteria:\n\n* Recipe and cooking instructions (40%)\n* Presentation (30%)\n* Cooking techniques and kitchen safety (20%)\n* Organization and clarity (10%)\n\n**Certification:**\nUpon successful completion of the task, the candidate will be awarded a Maggie Cooking Certification. The certification will be valid for a period of 2 years, after which the candidate will need to re-certify to maintain their certification status.",
            "invigilator": "John Doe",
            "observation_sheet": "**Maggie Cooking Certification Task Observation Sheet**\n\n**Candidate Name:** _____________________________________\n**Submission Type:** (.txt file/Video file) _____________________\n\n**Recipe and Cooking Instructions (40%):**\n\n1. Are the ingredients listed correctly? (5 points)\n2. Are the cooking instructions clear and concise? (10 points)\n3. Are the steps in the correct order? (10 points)\n4. Are the cooking times and temperatures accurate? (10 points)\n5. Are the recipe and instructions easy to follow? (5 points)\n\n**Total:** _______/40\n\n**Presentation (30%):**\n\n1. Is the presentation visually appealing? (10 points)\n2. Are the garnishes and presentation tips included? (5 points)\n3. Is the dish presented in a clean and appetizing way? (10 points)\n4. Are the presentation instructions clear and concise? (5 points)\n\n**Total:** _______/30\n\n**Cooking Techniques and Kitchen Safety (20%):**\n\n1. Are cooking techniques demonstrated correctly? (10 points)\n2. Are kitchen safety protocols followed? (5 points)\n3. Is the cooking process efficient and well-organized? (5 points)\n\n**Total:** _______/20\n\n**Organization and Clarity (10%):**\n\n1. Is the submission well-organized and easy to understand? (5 points)\n2. Is the language clear and concise? (3 points)\n3. Are the instructions easy to follow? (2 points)\n\n**Total:** _______/10\n\n**Total Score:** _______/100\n\n**Pass/Fail:** (Pass if score is 80% or higher)\n\n**Feedback:** _______________________________________________________\n\nNote: This observation sheet is used to evaluate the candidate's submission based on the certification criteria and grading rubric. The scores and feedback will be used to determine whether the candidate has passed the certification task."
        },
        {
            "task": "**Magiie Cooking Certification Task:**\n\n**Introduction:**\nThe goal of this certification task is to assess your culinary skills and knowledge in preparing a traditional Magiie dish. Magiie cuisine is a unique blend of flavors and spices, and this task will evaluate your ability to create a delicious and authentic Magiie meal.\n\n**Task Requirements:**\n\n1. **Dish Selection:** Choose a traditional Magiie dish, such as Magiie Chicken or Vegetable Biryani, and prepare it according to the recipe provided below.\n2. **Recipe:**\n\t* Ingredients:\n\t\t+ 1 cup basmati rice\n\t\t+ 1 cup mixed vegetables (carrots, peas, onions)\n\t\t+ 1 cup boneless chicken breast or thighs\n\t\t+ 2 tablespoons ghee or oil\n\t\t+ 1 teaspoon cumin seeds\n\t\t+ 1 teaspoon coriander powder\n\t\t+ 1 teaspoon turmeric powder\n\t\t+ 1 teaspoon red chili powder\n\t\t+ 1 teaspoon garam masala powder\n\t\t+ Salt, to taste\n\t* Instructions:\n\t\t1. Heat the ghee or oil in a large pan over medium heat.\n\t\t2. Add the cumin seeds and let them sizzle for a few seconds.\n\t\t3. Add the mixed vegetables and cook until they are tender.\n\t\t4. Add the chicken and cook until it is browned and cooked through.\n\t\t5. Add the basmati rice and stir to coat the rice with the ghee or oil.\n\t\t6. Add the coriander powder, turmeric powder, red chili powder, and garam masala powder. Stir well to combine.\n\t\t7. Add 2 cups of water and bring to a boil.\n\t\t8. Reduce the heat to low, cover, and simmer for 15-20 minutes or until the rice is cooked and the liquid is absorbed.\n3. **Presentation:** Garnish the dish with fresh cilantro, cucumber slices, and serve with a side of raita (yogurt sauce) or papadum.\n4. **Submission Requirements:**\n\t* Create a video file (MP4 or AVI) showcasing your cooking process, from preparation to presentation.\n\t* The video should be 10-15 minutes long and include the following:\n\t\t+ Introduction to the dish and its ingredients\n\t\t+ Step-by-step cooking instructions\n\t\t+ Tips and tricks for preparing the dish\n\t\t+ Final presentation and garnishing\n\t* Alternatively, you can submit a detailed text file (.txt) with the following:\n\t\t+ Introduction to the dish and its ingredients\n\t\t+ Step-by-step cooking instructions\n\t\t+ Tips and tricks for preparing the dish\n\t\t+ Final presentation and garnishing\n\t\t+ High-quality images of the dish at different stages of preparation\n5. **Evaluation Criteria:**\n\t* Taste and flavor (30 points)\n\t* Presentation and garnishing (20 points)\n\t* Cooking technique and skill (30 points)\n\t* Adherence to traditional Magiie cuisine (20 points)\n\n**Submission Guidelines:**\n\n1. Upload your video file or text file to a cloud storage service (Google Drive, Dropbox, or OneDrive).\n2. Share the link to your submission with the certification committee.\n3. Ensure that",
            "invigilator": "John Doe",
            "observation_sheet": "**Magiie Cooking Certification Task Observation Sheet**\n\n**Introduction:**\nThe goal of this observation sheet is to evaluate the culinary skills and knowledge of the candidate in preparing a traditional Magiie dish.\n\n**Task Requirements:**\n\n1. **Dish Selection:** \n   - Dish chosen: _____________________________________\n   - Traditional Magiie dish: Yes/No\n\n2. **Recipe:**\n   - Ingredients used: \n     - Basmati rice: Yes/No\n     - Mixed vegetables: Yes/No\n     - Boneless chicken breast or thighs: Yes/No\n     - Ghee or oil: Yes/No\n     - Spices (cumin seeds, coriander powder, turmeric powder, red chili powder, garam masala powder): Yes/No\n   - Instructions followed: \n     - Heating ghee or oil: Yes/No\n     - Adding cumin seeds: Yes/No\n     - Cooking mixed vegetables: Yes/No\n     - Cooking chicken: Yes/No\n     - Adding basmati rice: Yes/No\n     - Adding spices: Yes/No\n     - Adding water: Yes/No\n     - Simmering: Yes/No\n\n3. **Presentation:**\n   - Garnished with fresh cilantro: Yes/No\n   - Served with raita (yogurt sauce) or papadum: Yes/No\n   - Cucumber slices: Yes/No\n\n4. **Submission Requirements:**\n   - Video file (MP4 or AVI) submitted: Yes/No\n   - Video length: _________ minutes\n   - Introduction to dish and ingredients: Yes/No\n   - Step-by-step cooking instructions: Yes/No\n   - Tips and tricks: Yes/No\n   - Final presentation and garnishing: Yes/No\n   - Alternatively, detailed text file (.txt) submitted: Yes/No\n   - High-quality images: Yes/No\n\n**Evaluation Criteria:**\n\n1. **Taste and Flavor (30 points):**\n   - Score: _________/30\n   - Comments: _____________________________________\n\n2. **Presentation and Garnishing (20 points):**\n   - Score: _________/20\n   - Comments: _____________________________________\n\n3. **Cooking Technique and Skill (30 points):**\n   - Score: _________/30\n   - Comments: _____________________________________\n\n4. **Adherence to Traditional Magiie Cuisine (20 points):**\n   - Score: _________/20\n   - Comments: _____________________________________\n\n**Total Score:** _________/100\n\n**Recommendations:**\n- Passed: Yes/No\n- Resubmission required: Yes/No\n- Additional comments: _____________________________________"
        },
        {
            "task": "\n                    TASK DEADLINE: 2025-03-28\n                    \n                    **Class 1 Maths Addition Certification Task**\n\n**Task Title:** \"Addition Mastery for Class 1 Students\"\n\n**Objective:** To assess the student's ability to perform single-digit addition operations with accuracy and confidence.\n\n**Task Requirements:**\n\n1. **Submission Format:** The submission should be in the form of a video file (MP4 or AVI) or a text file (TXT) as per the student's preference.\n2. **Task Instructions:**\n\t* If submitting a video file, the student should record themselves solving the addition problems on a piece of paper or a whiteboard.\n\t* If submitting a text file, the student should type out the solutions to the addition problems.\n3. **Addition Problems:**\n\t* The student will be required to solve 10 single-digit addition problems, which will be provided below.\n\t* The problems will have addends ranging from 1 to 10.\n\n**Addition Problems:**\n\n1. 2 + 5 = \n2. 7 + 1 = \n3. 4 + 3 = \n4. 9 + 2 = \n5. 1 + 6 = \n6. 8 + 4 = \n7. 3 + 2 = \n8. 5 + 1 = \n9. 6 + 3 = \n10. 9 + 5 =\n\n**Assessment Criteria:**\n\n* Accuracy: The student's answers should be correct and accurate.\n* Neatness: The student's work should be neat and easy to read (if submitting a video file) or typed correctly (if submitting a text file).\n* Confidence: The student should demonstrate confidence in their ability to perform addition operations.\n\n**Submission Guidelines:**\n\n* The submission should be made within 30 minutes of starting the task.\n* The student should ensure that their submission is clear, legible, and easy to understand.\n* The student should include their name and class (Class 1) in the submission.\n\n**Evaluation:**\n\n* The student's submission will be evaluated based on the assessment criteria mentioned above.\n* The student will receive a certificate of completion upon successfully completing the task.\n\n**Certificate of Completion:**\n\nUpon completion of the task, the student will receive a certificate of completion, which will be awarded based on their performance. The certificate will be issued in the following categories:\n\n* **Distinction:** 90-100% accuracy\n* **Merit:** 80-89% accuracy\n* **Pass:** 70-79% accuracy\n* **Needs Improvement:** Below 70% accuracy\n\nNote: The certificate of completion will be issued by the instructor or teacher, and the student will receive feedback on their performance.\n                    \n                    Please ensure to complete and submit this task before the deadline.\n                    ",
            "invigilator": "John Doe",
            "observation_sheet": "**Class 1 Maths Addition Certification Task Observation Sheet**\n\n**Student Information:**\n\n* Name: _____________________________________\n* Class: Class 1\n\n**Task Submission:**\n\n* Submission Format: Video (MP4/AVI) / Text (TXT)\n* Submission Time: _____________________________\n\n**Assessment Criteria:**\n\n1. **Accuracy:**\n\t* Number of correct answers: _______/10\n\t* Percentage: _______%\n2. **Neatness:**\n\t* Work is neat and easy to read (video) / typed correctly (text): Yes / No\n3. **Confidence:**\n\t* Student demonstrates confidence in their ability to perform addition operations: Yes / No\n\n**Addition Problems:**\n\n1. 2 + 5 = _____________________\n2. 7 + 1 = _____________________\n3. 4 + 3 = _____________________\n4. 9 + 2 = _____________________\n5. 1 + 6 = _____________________\n6. 8 + 4 = _____________________\n7. 3 + 2 = _____________________\n8. 5 + 1 = _____________________\n9. 6 + 3 = _____________________\n10. 9 + 5 = _____________________\n\n**Evaluation:**\n\n* Percentage accuracy: _______%\n* Certificate of Completion category:\n\t+ Distinction (90-100%)\n\t+ Merit (80-89%)\n\t+ Pass (70-79%)\n\t+ Needs Improvement (Below 70%)\n* Feedback: _______________________________________________________\n\n**Certificate of Completion:**\n\n* Awarded: Yes / No\n* Category: _____________________________________\n* Date: ___________________________________________\n\nNote: This observation sheet is used to evaluate the student's performance in the Class 1 Maths Addition Certification Task and provide feedback for improvement."
        },
        {
            "task": "\n    TASK DEADLINE: 2025-04-01 (14 days)\n    \n    Certification Task: Real-World Addition Problem-Solving\n\n**Objectives:**\n\nThe objective of this certification task is to assess the candidate's ability to apply addition skills to real-world problems. The task aims to evaluate the candidate's understanding of addition concepts, their ability to analyze problems, and their capacity to provide accurate and practical solutions.\n\n**Specific Requirements:**\n\n1. Candidates will be given a set of real-world scenarios that require the application of addition skills.\n2. Each scenario will involve a different context, such as finance, measurement, or data analysis.\n3. Candidates will be required to read each scenario carefully, identify the addition problem, and provide a step-by-step solution.\n4. Candidates will submit their solutions in a .txt file or a video file, depending on their preference.\n5. The submission should include the candidate's name, certification task title, and a clear description of each solution.\n\n**Expected Deliverables:**\n\n1. A .txt file or a video file containing the candidate's solutions to the real-world scenarios.\n2. Each solution should include:\n\t* A clear restatement of the problem\n\t* A step-by-step calculation of the solution\n\t* A final answer with appropriate units (if applicable)\n3. The submission should be well-organized, easy to follow, and free of grammatical errors.\n\n**Evaluation Criteria:**\n\n1. **Accuracy** (40%): The candidate's solutions will be evaluated for accuracy, including correct calculations and units (if applicable).\n2. **Problem-Solving Skills** (30%): The candidate's ability to analyze each scenario, identify the addition problem, and provide a clear and step-by-step solution will be assessed.\n3. **Communication Skills** (20%): The candidate's ability to clearly describe each solution, including the problem statement, calculation, and final answer, will be evaluated.\n4. **Organization and Presentation** (10%): The candidate's submission will be assessed for organization, clarity, and overall presentation, including the use of proper formatting and grammar.\n\n**Submission Guidelines:**\n\n1. Candidates can submit their solutions in either a .txt file or a video file.\n2. The file should be named \"Addition_Certification_Task_[Candidate's Name]\".\n3. The submission should be sent to the designated email address or uploaded to the specified online platform.\n4. The deadline for submission is [insert date and time].\n\nBy completing this certification task, candidates will demonstrate their ability to apply addition skills to real-world problems, think critically, and communicate effectively. The evaluation criteria will assess the candidate's knowledge, problem-solving skills, and communication skills, providing a comprehensive assessment of their addition skills.\n    \n    Please ensure to complete and submit this task before the deadline.\n    Late submissions may affect evaluation.\n    ",
            "invigilator": "John Doe",
            "observation_sheet": "**Observation Sheet: Certification Task - Real-World Addition Problem-Solving**\n\n**Candidate's Name:** _____________________________________\n**Task Title:** Real-World Addition Problem-Solving\n**Submission Type:** (.txt file / video file)\n\n**Evaluation Criteria:**\n\n1. **Accuracy (40%)**\n\t* Are calculations correct?\n\t* Are units correct (if applicable)?\n\t* Score: _______/40\n2. **Problem-Solving Skills (30%)**\n\t* Can the candidate identify the addition problem?\n\t* Is the solution step-by-step and clear?\n\t* Score: _______/30\n3. **Communication Skills (20%)**\n\t* Is the problem statement clear?\n\t* Is the calculation and final answer well-explained?\n\t* Score: _______/20\n4. **Organization and Presentation (10%)**\n\t* Is the submission well-organized and easy to follow?\n\t* Is the formatting and grammar correct?\n\t* Score: _______/10\n\n**Additional Comments:**\n\n* Does the candidate demonstrate a clear understanding of addition concepts?\n* Are the solutions practical and relevant to the real-world scenarios?\n* Are there any areas where the candidate excels or needs improvement?\n\n**Overall Score:** _______/100\n\n**Pass/Fail:** Pass / Fail\n\n**Feedback:**\n\n* Provide constructive feedback to the candidate on their strengths and weaknesses.\n* Suggest areas for improvement and provide guidance on how to address any weaknesses."
        }
    ]
}